Revit 2026 API

# DuctSizeIteratorCurrent Property

---

Gets the item at the current position of the iterator.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual MEPSize Current { get; }
```
```vb
Public Overridable ReadOnly Property Current As MEPSize
	Get
```
```cpp
public:
virtual property MEPSize^ Current {
	MEPSize^ get ();
}
```
```fsharp
abstract Current : MEPSize with get
override Current : MEPSize with get
```

#### Property Value

MEPSize

#### Implements

IEnumeratorTCurrent

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

There is no current item if the iterator has not started yet or has been done.

#### Reference

DuctSizeIterator Class

Autodesk.Revit.DB.Mechanical Namespace